[
  {
    "role": "Старший разработчик Go",
    "company": "Ozon Bank",
    "summary": "Разрабатывал сервисы для проверки клиентов (KYC, ЗСК).\n\nДостижения:\n- Возглавлял проект с участием нескольких команд по интеграции с МВД (ГИС МУ) через СМЭВ для проаерки паспортов. Разработал целевую архитектуру решения, реализовал часть функционала на стороне KYC.\n\n Stack: Golang, Postgres, ClickHouse, Bash, Gitlab, microservice architecture",
    "range": "May 2023 - ..."
  },
  {
    "role": "Руководитель группы разработки (Salesforce)",
    "company": "Deutsche Bank",
    "summary": "Возглавлял команду разработки решения для сбора документов поставщиков для принятия в программы торгового финансирования, а также управления программами торгового финансирования. Помогал командам работать по методологиям экстремального программирования и BDD.\n\nДостижения:\n- Помогал команде адаптироваться к отсутствию ролей: никаких разработчиков, аналитиков или тестировщиков — все могут делать всё. Мы использовали парное программирование, TDD, BDD, ATDD. Все тесты были автоматизированы, автоматизация разрабатывалась до функциональности. Удалось достичь результата в 1 баг за полгода.\n- Построил ещё одну, новую, команду в такой же парадигме отсутствия ролей. Новая команда успешно приняла проект от другой команды, повысила качество выпускаемого продукта, снизила время поставок и построила продуктивные отношения с командой бизнеса.\n- Повысил продуктивность всей Salesforce практики, внедрив использование машин на Linux'е для разработки.\n- Выступил на нескольких конференциях: DUMP, TechLead Conf, Podlodka TechLead Crew, TestDriven Conf.\n- Провёл тренинг на внутреннем событии для всех техцентров по продвинутому использованию Git.\n- Сделал фреймворк для декларативных тестов фронтэнда на основе Jest.\n\n Stack: Salesforce (Apex, lwc), Bash, TeamCity, Java (test framework), JavaScript, RHEL 7",
    "range": "May 2020 - May 2023"
  },
  {
    "role": "Старший разработчик/Архитектор Salesforce",
    "company": "Aquiva Labs",
    "summary": "В мои обязанности входило управление несколькими командами, а также разработка архитектуры решений на платформе Salesforce.\n\nДостижения:\n- Создал и первоначально возглавлял команду глобальной поддержки проектов, вышедших из активной фазы разработки. Успешно подготовил нового лидера команды и передал дела.\n- Создал команду для срочных быстро-разрабатываемых проектов. В основном это были пакеты для Salesforce Appexchange.\n- Разработал и начал внедрение процедуры оценки сотрудников на основе индивидуальных целей, планов развития и обратной связи.\n- Возглавил разработку и внедрение стандартов написания кода в компании.\n- Провёл несколько внутренних тренингов по Salesforce и гибким методологиям разработки.\n- Выступил в роли Agile коача для нескольких команд, повысив их продуктивность.",
    "range": "August 2016 - March 2020"
  },
  {
    "role": "Разработчик/Scrum Мастер",
    "company": "Hotbot.ai",
    "summary": "Помогал команде адаптироваться к Lean и Agile разработке. Также принимал участие в создании MVP в качестве разработчика.\n\nДостижения:\n- Настроил автоматизированную развёртку и CI/CD, используя Docker, Docker Compose, и TeamCity.\n- Настроил мониторинг и соответствующие нотификации с помощью Zabbix.\n- Построил рабочую атмосферу в команде, помог адаптироваться к быстрому развитию и постоянным изменениям.",
    "range": "September 2017 - December 2018"
  }
]
