[
    {
        "role":"Руководитель группы разработки (Salesforce)",
        "company":"Deutsche Bank",
        "summary":"Возглавлял команду разработки решения для сбора документов поставщиков для принятив программы торгового финансирования, а также управления программами торгового финансирования. Помогал командам работать по методолгиям жкстремального программирования и BDD.\n\nДостижения:\n- Помогал команде адаптироваться к отсутствию ролей: никаких разработчиков, аналитиков или тестировщиков — все могут делать всё. Мы использовали парное программирование, TDD, BDD, ATDD. Все тесты были автоматизированы, автоматизация разрабатывалась до функциональности. Удалось достичь результата в 1 баг за полгода.\n- Построил ещё одну, новую, команду в такйо же парадигме отсутствия ролей. Новая команда успешно приняла проект от другой команды, повысила качество выпускаемого продукта, снизила время поставок и построила продуктивные отнощения с командой бизнеса.\n- Повысил продуктивность всей Salesforce практики, внедрив использование машин на Linux'е для разработки.\n- Выступил на нескольких конференциях: DUMP, TechLead Conf, Podlodka TechLead Crew, TestDriven Conf.\n- Провеёл тренинг на внутреннем собтии для всех техцентров по продвинутому использованию Git.\n- Сделал фреймворк для декларативных тестов фронтэнда на основе Jest.\n\n Stack: Salesforce (Apex, lwc), Bash, TeamCity, Java (test framework), JavaScript, RHEL 7",
        "range":"May 2020 - May 2023"
    },
    {
        "role":"Старший разработчик/Архитектор Salesforce",
        "company":"Aquiva Labs",
        "summary":"В мои обязанности входило управление несколькими командами, а так же разработка архитектуры решений на платформе Salesforce.\n\nДостижения:\n- Создал и первоначально возглавлял команду глобальной поддержки проектов, вышедших из активной фазы разработки. Успещно подготовил нового лидера команды и передеал дела.\n- Создал команду для срочных быстро-разрабатываемых проектов. В основном это были пакеты для Salesforce Appexchange.\n- Разработал и начал внедрение процедуры оценки сотрудников на основе индивидуальных целей, планов развития и обратной связи.\n- Возглавил разработку и внедрение стандартов написания кода в компании.\n- Провёл несколько внутренних тренингов по Salesforce и гибким методологиям разработки.\n- Выступил в роли Agile коача для нескольких команд, повысив их продуктивность.",
        "range":"August 2016 - March 2020"
    },
    {
        "role":"Разработчик/Scrum Мастер",
        "company":"Hotbot.ai",
        "summary":"Помогал команде адаптироваться к Lean и Agile разработке. Также принимал участие в создании MVP в качестве разработчика.\n\nДостижения:\n- Настроил автоматизированную развёртку и CI/CD, используя Docker, Docker Compose, и TeamCity.\n- Настроил мониторинг и соотвутствующие нотфикации с помощью Zabbix.\n- Построил рабочую атмосферу в команде, помога адаптироваться к быстрому развитию и постоянным изменениям.",
        "range":"September 2017 - December 2018"
    }
]
